УчетВУправляющихДляГит1/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаИнформационноеОбслуживаниеНалогоплательщика</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУслуги</name>
    <type>
      <types>EnumRef.ВидыУслугПриИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОтвета</name>
    <type>
      <types>EnumRef.ФорматОтветаНаЗапросИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставленияСправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйПараметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматЗапроса</name>
    <type>
      <types>EnumRef.ФорматыДокументооборотаСФНС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНалогов</name>
    <type>
      <types>EnumRef.КоличествоНалоговДляСверкиИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеНалоги</name>
    <attributes>
      <name>КБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКАТО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Enums/КоличествоНалоговДляСверкиИОН/КоличествоНалоговДляСверкиИОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КоличествоНалоговДляСверкиИОН</name>
  <enumValues>
    <name>Один</name>
  </enumValues>
  <enumValues>
    <name>Несколько</name>
  </enumValues>
  <enumValues>
    <name>Все</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/Forms/ФормаВыбораКоличестваНалогов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоНалогов = Строка(Параметры.КоличествоНалогов);
	
	ФлагиУчета = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ПолучитьФлагиИнтеграцииПоУмолчанию();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиПереопределяемый.ПолучитьЗначенияКонстантИнтеграции(ФлагиУчета);
	Если ЗначениеЗаполнено(ФлагиУчета) И ФлагиУчета.ИнтеграцияСБанком Тогда //Доступна и активна упрощенная отчетность
		ЭлВсе = Элементы.КоличествоНалогов.СписокВыбора.НайтиПоЗначению("Все");
		Если ЭлВсе <> Неопределено Тогда 
			Элементы.КоличествоНалогов.СписокВыбора.Удалить(ЭлВсе);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПредопределенноеЗначение("Перечисление.КоличествоНалоговДляСверкиИОН." + КоличествоНалогов));
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
